Yes, that worked. However my original config is not working, still. There probably is parameter issues, but I can not figure out which parameter it is. Terraform accepts the config.
Config:
```
resource "google_dataflow_job" "ps2b" {
  name = "dataflow-job"
  template_gcs_path = "gs://dataflow-templates/latest/Cloud_PubSub_to_Avro"
  temp_gcs_location = "gs://xxx-bucket/temp"
  on_delete = "drain"
  project = var.project_id
  zone = "europe-west3-a"
  service_account_email = google_service_account.sa.email
  parameters = {
    inputTopic = "someTopic"
    outputDirectory = "gs://xxx-bucket/output"
    outputFilenamePrefix = "output-"
    outputFilenameSuffix = ".txt"
  }
}
```
Output from terraform plan:
```
  + resource "google_dataflow_job" "ps2b" {
      + id                    = (known after apply)
      + job_id                = (known after apply)
      + name                  = "dataflow_job"
      + on_delete             = "drain"
      + parameters            = {
          + "inputTopic"           = "someTopic"
          + "outputDirectory"      = "gs://xxx_bucket/output"
          + "outputFilenamePrefix" = "output-"
          + "outputFilenameSuffix" = ".txt"
        }
      + project               = "myProject"
      + service_account_email = "someServiceUser"
      + state                 = (known after apply)
      + temp_gcs_location     = "gs://xxx_bucket/temp"
      + template_gcs_path     = "gs://dataflow-templates/latest/Cloud_PubSub_to_Avro"
      + type                  = (known after apply)
      + zone                  = "europe-west3-a"
    }
```


Output from terraform apply:
```
Error: googleapi: Error 400: The template parameters are invalid., badRequest
```